---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.TextTreatment
source: html/a5c70d54-21b3-c2e7-4d33-4532815111d5.htm
---
# Autodesk.Revit.DB.ACADExportOptions.TextTreatment Property

The text treatment.
 Deault value is TextTreatment.Exact.

## Syntax (C#)
```csharp
public TextTreatment TextTreatment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration